Tekla Open API Reference for Tekla Structures 2025
ViewMarkBasicSymbolAttributes Constructor
Overload List
Name | Description
ViewMarkBasicSymbolAttributes()
 Creates a new mark symbol attributes instance.
ViewMarkBasicSymbolAttributes(Double, MarkSymbolShape)
 Creates a new mark symbol attributes instance with the given size and shape.
Top
See Also
Reference
ViewMarkBasicSymbolAttributes Class
Tekla.Structures.Drawing Namespace